# Structural Oddities in the Groups Constructed

Here we describe in `GAP` code the examples stated in Section 4 of our paper. We make heavy use of the fact that `IdGroup` is an isomorphism invariant in `GAP`.

### Example 4.1: Isomorphic Groups with Two Extraspecial Subgroups

One example described is a set of parameters, namely Line 3 in Table 4, which has isomorphic groups corresponding to an extraspecial group of type `-` and `+`.
```
Line 3 Parameters
-----------------
   q m p k d b
   2 1 3 3 6 1
```
Here, we show the two constructed groups are isomorphic to `C13 x QD16`, and both are of rank 5 but arose from considering different classes of extraspecial groups.
In fact, `D8` and `Q8` are both extraspecial groups of order 8, and both are subgroups of `QD16`.
```gap
gap> StructureDescription(Line3MinusGrps[3]);
"C13 x QD16"
gap> StructureDescription(Line3PlusGrps[2]);
"C13 x QD16"
gap> IdGroup(Line3MinusGrps[3]);
[ 208, 26 ]
gap> IdGroup(Line3PlusGrps[2]);
[ 208, 26 ]
gap> GLp := GL(6, 3);;
gap> permp := IsomorphismPermGroup(GLp);;
gap> G0Perm := Image(permp, Line3MinusGrps[3]);
<permutation group of size 208 with 5 generators>
gap> Size(Orbits(G0Perm)) + 1;
5
gap> G0Perm := Image(permp, Line3PlusGrps[2]);
<permutation group of size 208 with 5 generators>
gap> Size(Orbits(G0Perm)) + 1;
5
```

### Example 4.2: Isomorphic Groups of Different Rank

Within the same set of parameters, it is possible that two isomorphic groups `G_0` may have a different number of orbits when acting on `V`.
Consider the following set of parameters along with extraspecial group type `+`:
```
Line 48 Parameters
------------------
   q m p k d b
   3 1 7 1 3 1
```
Two of the groups generated by these parameters are isomorphic but have different ranks, as shown here:
```gap
gap> StructureDescription(Line48PlusGrps[3]);
"((C3 x C3) : C3) : Q8"
gap> StructureDescription(Line48PlusGrps[6]);
"((C3 x C3) : C3) : Q8"
gap> IdGroup(Line48PlusGrps[3]);
[ 216, 88 ]
gap> IdGroup(Line48PlusGrps[6]);
[ 216, 88 ]
gap> GLp := GL(3, 7);;
gap> permp := IsomorphismPermGroup(GLp);;
gap> G0Perm := Image(permp, Line48PlusGrps[3]);
<permutation group of size 216 with 6 generators>
gap> Size(Orbits(G0Perm)) + 1;
4
gap> G0Perm := Image(permp, Line48PlusGrps[6]);
<permutation group of size 216 with 6 generators>
gap> Size(Orbits(G0Perm)) + 1;
5
```

### Example 4.3: Isomorphic Groups of the Same Rank in B\_1 and B_>

It is possible for two sets of parameters, one where `b = 1` and another where `b = 2`, to both produce isomorphic groups of the same rank.
Consider the following sets of parameters:
```
Line 2 Parameters
-----------------
   q m p k d b
   2 1 3 2 4 1

Line 53 Parameters
------------------
   q m p k d b
   2 1 3 1 4 2
```
One of the groups of rank 4 generated by Line 53 is isomorphic to a group of rank 4 generated by Line 2, as shown here:
```gap
gap> StructureDescription(Line53MinusGrps[1]);
"((C2 x C2 x C2) : (C2 x C2)) : C3"
gap> StructureDescription(Line2MinusGrps[9]);
"((C2 x C2 x C2) : (C2 x C2)) : C3"
gap> IdGroup(Line2MinusGrps[9]);
[ 96, 201 ]
gap> IdGroup(Line53MinusGrps[1]);
[ 96, 201 ]
gap> GLp := GL(4, 3);; permp := IsomorphismPermGroup(GLp);;
gap> GLp := GL(4, 3);;
gap> IdGroup(Line2MinusGrps[9]);
[ 96, 201 ]
gap> IdGroup(Line53MinusGrps[1]);
[ 96, 201 ]
gap> GLp := GL(4, 3);;
gap> permp := IsomorphismPermGroup(GLp);;
gap> G0Perm := Image(permp, Line2MinusGrps[9]);
<permutation group of size 96 with 6 generators>
gap> Size(Orbits(G0Perm)) + 1;
4
gap> GLp := GL(4, 3);;
gap> permp := IsomorphismPermGroup(GLp);;
gap> G0Perm := Image(permp, Line53MinusGrps[1]);
<permutation group of size 96 with 6 generators>
gap> Size(Orbits(G0Perm)) + 1;
4
```
